conf/bookrequest.xml

<soapenv:Envelope xmlns:ns="http://www.opentravel.org/OTA/2003/05"
                  xmlns:mes="http://www.ebxml.org/namespaces/messageHeader"
                  xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext"
                  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
        <sec:Security>
            <sec:UsernameToken>
                <sec:Username>403697</sec:Username>
                <sec:Password>WS341705</sec:Password>
                <Organization>8Z7I</Organization>
                <Domain>DEFAULT</Domain>
            </sec:UsernameToken>
            <sec:BinarySecurityToken>
                Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESA!ICESMSLB\/RES.LB!1588385324192!357!5!1
            </sec:BinarySecurityToken>
        </sec:Security>
        <mes:MessageHeader mes:id="d97ec94d-899f-425e-8f44-7978c53a1e85@icarrygo.com" mes:version="2.0">
            <mes:From>
                <mes:PartyId mes:type="urn:x12.org:IO5:01">www.icarrygo.com</mes:PartyId>
            </mes:From>
            <mes:To>
                <mes:PartyId mes:type="urn:x12.org:IO5:01">webservices.sabre.com</mes:PartyId>
            </mes:To>
            <mes:CPAId>8Z7I</mes:CPAId>
            <mes:ConversationId>jamiu@brakket.tech</mes:ConversationId>
            <mes:Service mes:type="OTA">EnhancedAirBookRQ</mes:Service>
            <mes:Action>EnhancedAirBookRQ</mes:Action>
            <mes:MessageData>
                <mes:MessageId>7640d5df-0fdf-4f7f-b562-980c8fe90c88@icarrygo.com</mes:MessageId>
                <mes:Timestamp>2020-05-02T03:08:44.830Z</mes:Timestamp>
            </mes:MessageData>
            <mes:Description xml:lang="en">Enhanced Air Book Service</mes:Description>
        </mes:MessageHeader>
    </soapenv:Header>
    <soapenv:Body>
        <EnhancedAirBookRQ version="3.2.0" IgnoreOnError="true" HaltOnError="true"
                           xmlns="http://services.sabre.com/sp/eab/v3_2">
            <OTA_AirBookRQ>
                <HaltOnStatus Code="NO"/>
                <HaltOnStatus Code="NN"/>
                <HaltOnStatus Code="UC"/>
                <HaltOnStatus Code="US"/>
                <OriginDestinationInformation>
                    <FlightSegment ResBookDesigCode="P" FlightNumber="203" DepartureDateTime="2020-08-13T15:30:00"
                                   ArrivalDateTime="2020-08-13T21:00:00" NumberInParty="0" Status="NN">
                        <DestinationLocation LocationCode="KGL"/>
                        <Equipment AirEquipType="738"/>
                        <MarketingAirline FlightNumber="203" Code="WB"/>
                        <MarriageGrp Ind="false"/>
                        <OperatingAirline Code="WB"/>
                        <OriginLocation LocationCode="LOS"/>
                    </FlightSegment>
                    <FlightSegment ResBookDesigCode="P" FlightNumber="304" DepartureDateTime="2020-08-14T00:40:00"
                                   ArrivalDateTime="2020-08-14T08:40:00" NumberInParty="0" Status="NN">
                        <DestinationLocation LocationCode="DXB"/>
                        <Equipment AirEquipType="738"/>
                        <MarketingAirline FlightNumber="304" Code="WB"/>
                        <MarriageGrp Ind="true"/>
                        <OperatingAirline Code="WB"/>
                        <OriginLocation LocationCode="KGL"/>
                    </FlightSegment>
                </OriginDestinationInformation>
            </OTA_AirBookRQ>
            <OTA_AirPriceRQ>
                <PriceComparison AmountSpecified="714126.0"/>
                <PriceRequestInformation Retain="true">
                    <OptionalQualifiers>
                        <PricingQualifiers CurrencyCode="NGN">
                            <BargainFinder Rebook="true"/>
                            <PassengerType Code="ADT" Quantity="1"/>
                        </PricingQualifiers>
                    </OptionalQualifiers>
                </PriceRequestInformation>
            </OTA_AirPriceRQ>
            <PostProcessing IgnoreAfter="false">
                <RedisplayReservation WaitInterval="5000"/>
            </PostProcessing>
            <PreProcessing IgnoreBefore="true"/>
        </EnhancedAirBookRQ>
    </soapenv:Body>
</soapenv:Envelope>
